---
kind: method
id: M:Autodesk.Revit.DB.FamilySizeTableColumn.GetSpecTypeId
source: html/fd4af0c2-583e-1c14-5525-2cf1cf7dd886.htm
---
# Autodesk.Revit.DB.FamilySizeTableColumn.GetSpecTypeId Method

Gets the identifier of the spec describing values in the column.

## Syntax (C#)
```csharp
public ForgeTypeId GetSpecTypeId()
```

## Returns
Identifier of the spec.